Revit 2027 API
Part.PartMaker Property
 The PartMaker that created this Part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PartMaker PartMaker { get; }
Public ReadOnly Property PartMaker As PartMaker
	Get
public:
property PartMaker^ PartMaker {
	PartMaker^ get ();
}
member PartMaker : PartMaker with get
Property Value
PartMaker
See Also
Reference
Part Class
Autodesk.Revit.DB Namespace